#include<iostream>
using namespace std;
int main()
{
    const int MAX = 100;
    double A[MAX], B[MAX], C[MAX];
    int nA, nB, nC, i, m;

    do {
        cout << "Input number N <" << MAX << endl; // Вивід повідомлення про введення значення N
        cin >> nA; // Отримання введеного значення N від користувача
    } while (nA<0 || nA>MAX); // Перевірка на валідність введеного значення N

    nB = nC = 0; // Ініціалізація змінних nB і nC для підрахунку елементів у масивах B та C

    for (i = 0; i < nA; i++) {
        cout << "A[" << i << "]="; // Вивід повідомлення про введення значення A[i]
        cin >> A[i]; // Отримання введеного значення A[i] від користувача
    }

    do {
        cout << "Input index m (0<=m<" << nA << ") " << endl; // Вивід повідомлення про введення індексу m
        cin >> m; // Отримання введеного значення m від користувача
    } while (m < 0 || m >= nA); // Перевірка на валідність введеного значення m

    for (i = 0; i < nA; i++) {
        if (A[i] > A[m]) // Перевірка, чи елемент масиву A[i] більший за A[m]
            B[nB++] = A[i]; // Додавання елементу масиву A до масиву B, якщо він більший за A[m]
        else
            C[nC++] = A[i]; // Додавання елементу масиву A до масиву C, якщо він менший або рівний A[m]
    }

    cout << "Result:" << endl; // Виведення повідомлення про результат

    cout << "B : " << endl; // Вивід повідомлення про масив B
    for (i = 0; i < nB; i++)
        cout << B[i] << "\t"; // Виведення елементів масиву B

    cout << "\nC : " << endl; // Вивід повідомлення про масив C
    for (i = 0; i < nC; i++)
        cout << C[i] << "\t"; // Виведення елементів масиву C

    cout << "\nExit\n"; // Виведення повідомлення про вихід

    return 0; // Повернення нульового значення, що означає успішне завершення програми
}
